W4D1/app/controllers/books_controller.rb

  def create
    Book.create(title: params[:book][:title], author: params[:book][:author])
---
INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Harry Potter and the Order of the Phoenix"], ["author", "J.K. Rowling"], ["created_at", "2016-07-27 17:04:33.390634"], ["updated_at", "2016-07-27 17:04:33.390634"]]

  def destroy
    Book.find(params[:id]).destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]